---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.BalancedLoad
source: html/c4b32c2d-e025-d300-1776-6d98ed07c703.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.BalancedLoad Property

Reports whether the BalancedLoad is on or off.

## Syntax (C#)
```csharp
public bool BalancedLoad { get; }
```

## Remarks
This property is used to retrieve the BalancedLoad value of the Electrical System.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This property only available when System Type is Power!